/*
Створити клас – Коло. У закритій частині визначити поля:
• x, • y – координати центру та 
• R – радіус. Методи:
• обчислюють площу, 
• довжину кола, 
• встановлюють поля і 
• повертають їх значення. Методи встановлення значень полів класу мають 
перевіряти коректність параметрів, що задаються. Розробити функцію виведення 
полів даних класу.
*/

#include <iostream>
#include "Project_class.h"

int main()
{
	Circle g;
	g.Read();
	g.Display();
	cout << "S = " << g.get_Area() << endl;
	cout << "l = " << g.get_Long() << endl;

	return 0;
}